app/controllers/new_devise/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "last_sign_out_at" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["last_sign_out_at", 2016-11-18 21:13:07 UTC], ["updated_at", 2016-11-18 21:13:07 UTC], ["id", 1]]
---
  def destroy
    @user = User.find(current_user.id)
    @user.last_sign_out_at = Time.now
    @user.save