app/views/users/show.html.haml

SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = $1  [["user_id", 1]]
---

-if @user.events.count

SELECT "events".* FROM "events" WHERE "events"."user_id" = $1  [["user_id", 1]]
---
        Created
      -@user.events.each do |event|