app/views/pictures/show.html.haml

  %br
  ="Likes: #{@picture.likes.count}"
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."picture_id" = $1  [["picture_id", 1]]