app/controllers/categories_controller.rb

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."category_id" = $1 ORDER BY "pictures"."likes_count" DESC LIMIT $2 OFFSET $3  [["category_id", 9], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "pictures" WHERE "pictures"."category_id" = $1  [["category_id", 1]]
---
  def show
    @pictures = Category.find(params[:id]).pictures.order(:likes_count => :desc).page params[:page]