app/controllers/comments_controller.rb

  def index
    @comments = Comment.order(:created_at)
---
SELECT "comments".* FROM "comments" ORDER BY "comments"."created_at" ASC

  def show
    @comments = User.find(params[:id]).comments
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]

  def create
    @comment = @picture.comments.create(params[:comment].permit(:text))
---
INSERT INTO "comments" ("text", "user_id", "picture_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "123"], ["user_id", 1], ["picture_id", 2], ["created_at", 2016-11-18 21:17:13 UTC], ["updated_at", 2016-11-18 21:17:13 UTC]]

  def find_picture
    @picture = Picture.find(params[:picture_id]) if params[:picture_id]
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def find_comment
    @comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]