app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def load_comment
    @comments = User.find(params[:id]).comments