app/controllers/likes_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 2]]
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
---
  def show
    @pictures = []
    @likes = User.find(params[:id]).likes
    @likes.each do |like|
      @pictures << Picture.find(like.picture_id).url

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."picture_id" = $1 AND "likes"."user_id" = $2  [["picture_id", 39], ["user_id", 2]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."picture_id" = $1 AND "likes"."user_id" = $2  [["picture_id", 39], ["user_id", 1]]
INSERT INTO "likes" ("user_id", "picture_id", "created_at", "updated_at", "picture_url") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["picture_id", 50], ["created_at", 2016-11-19 00:28:01 UTC], ["updated_at", 2016-11-19 00:28:01 UTC], ["picture_url", "tits/tits_9.jpg"]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 3]]
---
  def create
    @picture = Picture.find(params[:picture_id])

    if @picture.likes.where(:user_id => params[:user_id]).empty?
      @like = Like.new
      @like = @picture.likes.create
      @like.user_id = current_user.id
      @like.picture_url = @picture.url
      p @like
      @like.save
    else
      @picture.likes.where(:user_id => params[:user_id]).destroy_all