app/controllers/pictures_controller.rb

  def index
    @pictures = Picture.order(:likes_count => :desc).page(params[:page])
---
SELECT  "pictures".* FROM "pictures" ORDER BY "pictures"."likes_count" DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "pictures"

  def show
    @picture = Picture.find(params[:id])

      # @next = @picture == Picture.last ? Picture.first : Picture.find(params[:id].to_i + 1)
      # @prev = @picture == Picture.first ? Picture.last : Picture.find(params[:id].to_i - 1)

      # better way with picture.rb model code in
      @next = @picture == Picture.last ? Picture.first : @picture.next
---
SELECT  "pictures".* FROM "pictures" WHERE (id < 4) ORDER BY "pictures"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  "pictures".* FROM "pictures" ORDER BY "pictures"."id" DESC LIMIT $1  [["LIMIT", 1]]