app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @events = User.find(params[:id]).events
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."user_id" = $1  [["user_id", 1]]

  def find_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]